НВ_Доработки/AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

НВ_Доработки/AccumulationRegisters/ТоварыВРезервеНаСкладах/Ext/ManagerModule.bsl
// Получение остатков по резервам
Функция НВД_ПолучитьОстаткиПоРезервамНамоментВремени(МоментВремени, СписокПозиций, Организация) Экспорт
	
	//++ №13982 на случай, когда резервы списываются по заказу покупателя, сделаем заглушку
	Если СписокПозиций.Колонки.Найти("ЗаказДоговор") = Неопределено Тогда
		СписокПозиций.Колонки.Добавить("ЗаказДоговор", новый ОписаниеТипов("ДокументСсылка.ЗаказДоговор"));
	КонецЕсли;
	//-- №13982
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Организация КАК Организация,
	|	Позиции.Склад КАК Склад,
	|	Позиции.Номенклатура КАК Номенклатура,
	|	Позиции.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Позиции.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Позиции.Заказ КАК ДокументРезерва,
	//++ №13982
	|	Позиции.ЗаказДоговор КАК ЗаказДоговор,
	//-- №13982
	|	Позиции.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
	|	Позиции.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Позиции			
	|ИЗ
	|	&СписокТоваров КАК Позиции
	|;	
	|//////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Позиции.Организация КАК Организация,
	|	Позиции.Склад КАК Склад,
	|	Позиции.Номенклатура КАК Номенклатура,
	|	Позиции.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Позиции.ДокументРезерва КАК ДокументРезерва,
	//++ №13982
	|	Позиции.ЗаказДоговор КАК ЗаказДоговор,
	//-- №13982
	|	Позиции.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Позиции.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
	|	ЕСТЬNULL(Позиции.Количество, 0) КАК КоличествоВДокументе,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоВРезерве,
	//++ №13982
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиПоДоговору.КоличествоОстаток, 0) КАК КоличествоВРезервеПоДоговору
	//-- №13982
	|ИЗ
	|	ВТ_Позиции КАК Позиции
	|
	// №11431|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ТекДата) КАК ТоварыВРезервеНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&МоментВремени) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО Позиции.Организация = ТоварыВРезервеНаСкладахОстатки.Организация
	|			И Позиции.Склад = ТоварыВРезервеНаСкладахОстатки.Склад
	|			И Позиции.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|			И Позиции.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
	|			И Позиции.ДокументРезерва = ТоварыВРезервеНаСкладахОстатки.ДокументРезерва
	|			И Позиции.СерияНоменклатуры = ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры
	|			И Позиции.ВидТабличнойЧасти = ТоварыВРезервеНаСкладахОстатки.ВидТабличнойЧасти
	|		
	//++ №13982
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&МоментВремени) КАК ТоварыВРезервеНаСкладахОстаткиПоДоговору
	|		ПО Позиции.Организация = ТоварыВРезервеНаСкладахОстаткиПоДоговору.Организация
	|			И Позиции.Склад = ТоварыВРезервеНаСкладахОстаткиПоДоговору.Склад
	|			И Позиции.Номенклатура = ТоварыВРезервеНаСкладахОстаткиПоДоговору.Номенклатура
	|			И Позиции.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстаткиПоДоговору.ХарактеристикаНоменклатуры
	|			И Позиции.ЗаказДоговор = ТоварыВРезервеНаСкладахОстаткиПоДоговору.ДокументРезерва
	|			И Позиции.СерияНоменклатуры = ТоварыВРезервеНаСкладахОстаткиПоДоговору.СерияНоменклатуры
	|			И Позиции.ВидТабличнойЧасти = ТоварыВРезервеНаСкладахОстаткиПоДоговору.ВидТабличнойЧасти
	//-- №13982
	|
	|ГДЕ
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
	//++ №13982
	|	Или ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиПоДоговору.КоличествоОстаток, 0) > 0
	//-- №13982
	|
	|";
	// №11431 комментируем т.к. остатки резервов берем на текущую дату Запрос.УстановитьПараметр("ТекДата", Дата);
	Запрос.УстановитьПараметр("СписокТоваров", СписокПозиций);
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
